// створимо окрему функцію яка буде звертатись до сервера щоб отримати список юзерів (чистий код)

// сама папка api це місце збору таких функцій яка будуть виходити назовні (в мережу, сервер, бази даних),
// її краще розташовувати в папці src на одному рівні з components, щоб всі окремі речі зберігались в окремих місцях
// в components зберігаються всі компоненти, в api - всі файли для роботи з api
// тут я залишу цю папку в папці цього компонента щоб все що його стосується було в одному місці для наглядності

// ф-я приймає обєкт параметрів, де 
// page - це currentPage з основного компонета
// results - кількість обєктів юзерів які ми хочемо завантажити за 1 раз (параметри самого посилання)
// seed - завантажувати тих самих юзерів а не рандомних (параметри самого посилання)
// inc (include)- які саме властивості з обєкта юзера нам потрібні, не всі а конкретні (параметри самого посилання)

// функція повертає проміс із розпарсеними даними які ми перехопимо в методі loadUsers головного компонента для подальшої обробки
function getUsers(options) {
    const {page, results, seed, inc} = options;

    return fetch(
        `https://randomuser.me/api/?
        results=${results}}&seed=${seed}&page=${page}&inc=${inc}`
    ).then(response => response.json());
}

export default getUsers;