// створимо окремий обєкт який буде зберігати базові конфігурації для налаштування рядка запиту URL (чистий код)

// сама папка сщташпі це місце збору таких параметрів які будуть зберігати пакети параметрів,
// її краще розташовувати в папці src на одному рівні з components, щоб всі окремі речі зберігались в окремих місцях
// в components зберігаються всі компоненти, в api - всі файли для роботи з api, в configs всі параметри налаштувань
// тут я залишу цю папку в папці цього компонента щоб все що його стосується було в одному місці для наглядності

// все називаю з вуликими буквами бо це незмінні дані (константи)
const CONFIGS = {
    BASE_URL: 'https://randomuser.me/api/',
    RESULTS_ORDER: 'pe2022',    // seed
    RESULTS_COUNT: 7,
    INCLUDING_RESULTS: ['name', 'gender', 'email', 'login'],
};

export default CONFIGS;